# 1.Создайте переменные, описывающие автомобиль - модель, цвет, год, количество дверей.
# Поместите в них значения. Затем поменяйте цвет автомобиля, присвоив ниже в коде новое
# значение соответствующей переменной. Выведите на экран все значения.  При создании имён
# переменных используйте подходящие по смыслу слова. Воспользуйтесь Google переводчиком,
# если нужно.
carModel = "BMW M5"
carColor = "Black"
carAge = 2019
carDoors = 5

carColor = "White"

print(carModel)
print(carColor)
print(carAge)
print(carDoors)

# 2.Создайте переменные, в которые будете помещать возраст людей. Также создайте переменную,
# в которой будет храниться количество людей.  Вычислите и выведите на экран средний возраст
# человека исходя из данных о возрасте этих пятерых людей. Если не знаете формулу вычисления
# среднего арифметического значения, воспользуйтесь поиском информации в интернете.
# При создании имён переменных используйте подходящие по смыслу слова.
# Воспользуйтесь Google переводчиком, если нужно.

peopleOne = 22
peopleTwo = 32
peopleThree = 9
peopleFour = 15
peopleFive = 42
people = 5

peopleAgeAll = (peopleOne + peopleTwo + peopleThree + peopleThree + peopleFour + peopleFive) / people

